space-explorer-backend/app/controllers/characters_controller.rb

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def show
        @character = Character.find(params[:id])