space-explorer-backend/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "character_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Lucy"], ["character_id", "1"], ["created_at", "2019-05-29 08:53:49.540881"], ["updated_at", "2019-05-29 08:53:49.540881"]]
---
    def create
        user = User.create(name: params[:name], character_id: params[:character_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "character_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Char"], ["character_id", "2"], ["updated_at", "2019-05-29 09:00:53.559369"], ["id", 6]]
---
    def update
        user = User.find(params[:id])
        user.update(name: params[:name], character_id: params[:character_id])